In [1]:
from pandas import DataFrame
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import pandas
import numpy

In [3]:
!ls -l /home/dsc/Data/opentraveldata/optd_aircraft.csv

-rw-r--r--. 1 dsc dsc 18612 Nov  8 14:10 /home/dsc/Data/opentraveldata/optd_aircraft.csv

In [6]:
# cargamos el fichero en un dataframe:
aircraftdf = pd.read_csv("/home/dsc/Data/opentraveldata/optd_aircraft.csv",sep="^")

In [9]:
aircraftdf.head()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN

In [11]:
aircraftdf.head(10)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN
5,14F,BAe,146 Freighter (-100/200/300QT & QC),NaN,NaN,NaN,NaN,NaN
6,14X,BAe,146 Freighter (-100QT & QC),14F,4J,B461,4,J
7,14Y,BAe,146 Freighter (-200QT & QC),14F,4J,B462,4,J
8,14Z,BAe,146 Freighter (-300QT & QC),14F,4J,B463,4,J
9,19D,Airbus,A319,NaN,NaN,NaN,NaN,NaN

In [12]:
len(aircraftdf)

457

In [13]:
aircraftdf.describe()

       nb_engines
count  343.000000
mean     2.408163
std      0.842679
min      1.000000
25%      2.000000
50%      2.000000
75%      3.000000
max      6.000000

In [14]:
aircraftdf.columns

Index([u'iata_code', u'manufacturer', u'model', u'iata_group',
       u'iata_category', u'icao_code', u'nb_engines', u'aircraft_type'],
      dtype='object')

In [20]:
aircraftdf.sort("manufacturer",ascending=False).head()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
452,YK2,Yakovlev / Jakovlev,Yak 42,YK2,3J,YK42,3,J
453,YK4,Yakovlev / Jakovlev,Yak 40,YK4,3J,YK40,3,J
405,MA6,Xian,MA-60,MA6,2T,AN24,2,T
455,YN7,Xian,Yunshuji Y7,YN7,2T,AN24,2,T
449,VCV,Vickers,Viscount,NaN,NaN,NaN,NaN,NaN

In [22]:
aircraftdf.rank().head()

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,1,336.5,2,2,92.5,254.0,134,128
1,2,89.0,9,4,307.0,94.5,312,128
2,3,89.0,201,4,307.0,96.5,312,128
3,4,89.0,10,4,307.0,98.5,312,128
4,5,89.0,4,NaN,NaN,NaN,NaN,NaN

In [24]:
#Las funciones de series pueden aplicarse sobre dataframes:

aircraftdf.sum()

nb_engines    826
dtype: float64

In [25]:
aircraftdf.to_csv("salida.csv")